OdDAI.Binary.op_Assign(OdDAI.Binary!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The assignment operator for Binary objects.
\param other [in] Another Binary object to assign (right-hand operand of the assignment operation).
\returns The reference to the Binary object modified by the assignment operation.

OdDAI.Binary.op_Inequality(OdDAI.Binary!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The inequality operator for Binary objects.
\param other [in] Another Binary object to compare with (right-hand operand of the comparison operation).
\returns true if this Binary object is not equal to another specified with the input parameter; otherwise, the operator returns false.

OdDAI.Binary.op_LessThan(OdDAI.Binary!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The "less than" operator for Binary objects.
\param other [in] Another Binary object to compare with (right-hand operand of the comparison operation).
\returns true if this Binary object is less than another specified with the input parameter; otherwise, the operator returns false.

OdDAI.Binary.op_Equality(OdDAI.Binary!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The equality operator for Binary objects.
\param other [in] Another Binary object to compare with (right-hand operand of the comparison operation).
\returns true if this Binary object equals to another specified with the input parameter; otherwise, the operator returns false.

OdDAI.Binary.setMemory(OdArray&lt;System.Byte,OdObjectsAllocator&lt;System.Byte&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the Binary object value from a specified memory buffer.
\param newBuffer [in] A memory buffer with new data to set.

OdDAI.Binary.getMemory(OdArray&lt;System.Byte,OdObjectsAllocator&lt;System.Byte&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the Binary object value represented as a byte array (memory buffer).
\param memoryBuffer [out] A buffer to be filled with bytes of the Binary value.
\returns true if the Binary object value was successfully written as a byte array in a specified buffer; otherwise, the method returns false.

OdDAI.Binary.setBinaryString(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Sets string to represented in binary view to Binary instance.
\param newData [in] a binary string.

OdDAI.Binary.getBinaryString
\details
Retrieves a string to internal Binary data represented in binary view.
\returns Returns a pointer to string which represents internal buffer in binary view.

OdDAI.Binary.setBuffer(OdArray&lt;System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte,OdObjectsAllocator&lt;System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets new data buffer to Binary instance.
\param newBuffer [in] new data buffer.

OdDAI.Binary.getBuffer
\details
Provides a constant reference to internal Binary buffer.
\returns Returns a constant reference to internal buffer.

OdDAI.Binary.setAnsiString(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assigns hexadecimal string value to Binary.
\param buffer [in] string hexadecimal value.

OdDAI.Binary.getAnsiString
\details
Provides a string which represents currently settled binary data.
\returns Returns string that represents a current settled value. If Binary is unset the function returns empty string.

OdDAI.Binary.nullify
\details
Makes Binary instance unset.

OdDAI.Binary.exists
\details
Retrieves if Binary instance has a value.
\returns Returns true if Binary instance has assigned value; otherwise returns false.

OdDAI.Binary.length
\details
Retrieves current binary data length.
\returns Returns a long value that represents a length of current binary data.

OdDAI.Binary.length(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets current data length for binary data.
\param newLength [in] new value of data length.

OdDAI.Binary.maximum
\details
Retrieves maximum binary data length.
\returns Returns maximum binary data length.

OdDAI.Binary.Dispose
\details
Destroys binary instance.

OdDAI.Binary.#ctor(OdDAI.Binary!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new Binary instance as a copy of another Binary instance (copy constructor).
\param other [in] An original Binary instance to be copied.

OdDAI.Binary.#ctor(OdDAI.BinaryType!System.Runtime.CompilerServices.IsConst*)
\details
Creates a new Binary instance with specified parameters.
\param binaryType [in] binary type to initialize max size and buffer at binary.

OdDAI.Binary.#ctor(System.UInt32!System.Runtime.CompilerServices.IsLong,OdArray&lt;System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte,OdObjectsAllocator&lt;System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new Binary instance with specified parameters.
\param maxSize [in] The long value for the max size for binary buffer.
\param newBuffer [in] initialize buffer for binary.

OdDAI.Binary.#ctor(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Creates a new Binary instance with specified parameters.
\param maxSize [in] The long value for the max size for binary buffer.

OdDAI.Binary.#ctor
\details
Creates a new Binary instance with default parameters.

OdDAI.Binary
\details
A class that implements the EXPRESS BINARY data type within Standard Data Access Interface (SDAI).